import requests
from ipdb import set_trace

url = "http://192.168.12.211:5003/upload"
data = {"seg":"右乳癌4程新辅助化疗后右乳癌改良根治术标本：（右乳房组织）浸润性乳腺癌，倾向III级，非特殊类型，合并少量（5%）高级别导管原位癌（粉刺型）。肿瘤大小4cm×3cm×3cm，癌组织松散，固定欠佳，细胞有退变，但癌细胞总量仍高，未见明显消退，间质纤维伴少量淋巴浆细胞浸润，小区含铁血黄素沉着，化疗后MP评级为2级。可见脉管内癌栓，未见神经侵犯。癌组织侵犯至皮下真皮层，乳头未见癌，上下内外及基底切缘阴性。其余乳腺导管上皮细胞增生。（右胸肌间组织）纤维脂肪组织，未见癌。取材腋窝脂肪找到淋巴结9/12枚，（右第Ⅲ组淋巴结）1/1枚，有转移癌，最大癌径0.6cm，转移癌未见明显化疗反应，阴性淋巴结未见化疗反应。淋巴结被膜外有多个脉管内癌栓。免疫组化浸润癌表达：ER(SP1)（-），PR(1E2)（-），Ki67（+50%）。<Return>伴随诊断：HER-2(4B5)（3+，阳性）。<Return>"}

r = requests.post(url,data)
set_trace()
print(r.json())
